{
  "backend/main.mo": "Main actor for the HR/scheduling backend, defining all data types, state, and public methods for user profiles, access control, employee records, shifts, holidays, documents, inventory, badges, and more. Includes role-based authorization, user approval flows, and CRUD operations for all major entities.",
  "backend/migration.mo": "Migration module that initializes badge and staff-badge maps, seeding a predefined set of badges across categories (Attendance, Performance, Experience, Team, Milestones) for use on actor upgrade.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (red/white/black restyle, dropdown fix, badges tab, etc.) to the specific frontend files changed and the test IDs that verify them.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of each frontend source file, serving as a reference index for the project's React components, pages, and hooks.",
  "frontend/index.css": "Global CSS entry point that sets up Tailwind directives and defines CSS custom properties for the light and dark theme colour tokens (background, foreground, primary, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app into a `#root` div and loading the TypeScript entry point via a module script.",
  "frontend/src/App.tsx": "Root React component that handles authentication state, admin bootstrapping via `markAdminLoggedInSuccessfully`, page routing, and renders the sidebar/header layout with all page components. Uses React Query for profile, admin status, and role data.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their full name to create their ESC-HR profile, using the `useSaveCallerUserProfile` mutation hook.",
  "frontend/src/components/authorization/AccessDeniedScreen.tsx": "A full-page screen displayed when a user lacks permission to access a route, with a button to navigate back to the employee portal.",
  "frontend/src/components/documents/AddDocumentModal.tsx": "A dialog form for creating a new document with fields for title, description, category, file URL, content, and visibility, submitting via the `useAddDocument` mutation.",
  "frontend/src/components/documents/EditDocumentModal.tsx": "A dialog form pre-populated with an existing document's data, allowing admins to update its fields via the `useUpdateDocument` mutation.",
  "frontend/src/components/employees/AddEmployeeModal.tsx": "A dialog form for adding a new employee with fields for personal info, start date, and role (admin-only role selector), submitting via the `useAddEmployee` mutation.",
  "frontend/src/components/employees/ConfirmDeactivateDialog.tsx": "An alert dialog that confirms toggling an employee's active/inactive status, calling `useUpdateEmployee` on confirmation.",
  "frontend/src/components/employees/EditEmployeeModal.tsx": "A dialog form pre-populated with an existing employee's data, allowing updates to personal info and role (admin-only) via the `useUpdateEmployee` mutation.",
  "frontend/src/components/employees/EmployeeTable.tsx": "Renders a table of employees with columns for name, job title, department, start date, and status, plus action buttons to view profile, edit, or deactivate/reactivate each employee.",
  "frontend/src/components/layout/Header.tsx": "Top navigation header displaying the current page title, a notification bell, the logged-in user's name/admin badge, and a logout button using Internet Identity.",
  "frontend/src/components/layout/Layout.tsx": "Deprecated stub file kept for backward compatibility that renders nothing; the app now uses MainLayout directly.",
  "frontend/src/components/layout/MainLayout.tsx": "Main application shell that composes the Sidebar and Header around a scrollable content area, accepting navigation state and user role props.",
  "frontend/src/components/layout/Sidebar.tsx": "Left navigation sidebar with grouped nav items (Overview, People, Recognition, Resources, Finance, Admin), filtering out admin-only items for non-admin users and highlighting the active page.",
  "frontend/src/components/profile/AddAppraisalModal.tsx": "Modal dialog for scheduling an employee appraisal, with fields for date, type (annual/mid-year/probationary), notes, and completion status, submitting via the useAddAppraisalRecord mutation.",
  "frontend/src/components/profile/AddManagerNoteModal.tsx": "Modal dialog for adding a typed manager note (general, concern, sickness, performance) to an employee record, submitting via the useAddManagerNote mutation.",
  "frontend/src/components/profile/AddSicknessModal.tsx": "Modal dialog for logging an employee sickness absence with start/end dates, reason, and return-to-work note, submitting via the useAddSicknessRecord mutation.",
  "frontend/src/components/profile/AddTrainingModal.tsx": "Modal dialog for adding a new training record to an employee, with fields for title, description, dates, and status, using the useAddTrainingRecord mutation.",
  "frontend/src/components/profile/AppraisalsTab.tsx": "Tab component displaying an employee's appraisal records sorted by date, with options to add or edit appraisals via modals.",
  "frontend/src/components/profile/AssignBadgeModal.tsx": "Modal for searching and selecting a badge to assign to an employee, grouped by category with an optional note field.",
  "frontend/src/components/profile/BadgesTab.tsx": "Tab component displaying an employee's assigned achievement badges in a grid, with admin controls to assign or remove badges.",
  "frontend/src/components/profile/EditAppraisalModal.tsx": "Modal for editing an appraisal record by creating a new entry (since the backend lacks an update endpoint), with fields for date, type, notes, and completion status.",
  "frontend/src/components/profile/EditManagerNoteModal.tsx": "Modal dialog for editing an existing manager note's type and content, using the useUpdateManagerNote mutation.",
  "frontend/src/components/profile/EditSicknessModal.tsx": "Modal dialog for editing a sickness record; since the backend lacks an update endpoint, it creates a new corrected record via `useAddSicknessRecord` as a workaround.",
  "frontend/src/components/profile/EditTrainingModal.tsx": "Modal dialog for editing an existing training record, using `useUpdateTrainingRecord` to persist changes including title, dates, status, and description.",
  "frontend/src/components/profile/ManagerNotesTab.tsx": "Tab component that displays, filters, adds, edits, and deletes manager notes for a given employee, with note-type badges and author name resolution.",
  "frontend/src/components/profile/SicknessTab.tsx": "Tab component that lists an employee's sickness records sorted by date, shows total absence days, and provides add/edit functionality via modals.",
  "frontend/src/components/profile/TrainingTab.tsx": "Tab component that displays an employee's training records with status badges and expiry warnings, and supports adding or editing records via modals.",
  "frontend/src/components/resources/AddResourceModal.tsx": "Modal dialog for creating a new secure resource with title, category, content, and a restricted-access toggle, submitted via `useAddResource`.",
  "frontend/src/components/resources/EditResourceModal.tsx": "Modal dialog for editing an existing resource, allowing updates to title, category, content/URL, and restricted access toggle, with form validation and toast notifications.",
  "frontend/src/components/scheduling/AddShiftModal.tsx": "Modal dialog for creating a new shift with date, time, department, and employee assignment fields, submitting via the useAddShift mutation.",
  "frontend/src/components/scheduling/EditShiftModal.tsx": "Modal dialog for editing an existing shift by pre-populating form fields from the shift data; since updateShift is unavailable, it creates a new shift record via useAddShift.",
  "frontend/src/components/scheduling/ShiftCard.tsx": "Compact card component displaying a shift's department, time range, and assigned employees, with hover-revealed edit and view action buttons.",
  "frontend/src/components/scheduling/ShiftDetailModal.tsx": "Modal showing full shift details including assigned employees and shift notes, with the ability to add or edit notes (edit creates a new note entry) via useAddShiftNote.",
  "frontend/src/components/scheduling/WeeklyCalendar.tsx": "Weekly calendar grid component that renders a column per day, filtering and sorting shifts by date and displaying them as ShiftCard components.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, wrapping DFINITY's AuthClient to expose login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks (useQuery/useMutation) for all backend actor calls, covering user profiles, roles, approvals, employees, training, shifts, holidays, documents, inventory, badges, and more.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS with a red/white/black escape-room theme via CSS custom properties, and adds scrollbar and dropdown background fixes.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging, ID generation, nanosecond timestamp conversions, date/time formatting, week calculation, expiry checks, and currency formatting.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with TanStack QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminApprovalQueuePage.tsx": "Admin-only page that lists pending, approved, and rejected user access requests, allowing admins to approve or reject them via mutation hooks.",
  "frontend/src/pages/AppraisalsDashboardPage.tsx": "Admin-only dashboard page that lists all active employees with their appraisal status (overdue, due soon, or up to date) based on the last completed appraisal, and navigates to individual employee profiles.",
  "frontend/src/pages/CompanyDocumentsPage.tsx": "Page for browsing company documents (handbooks, policies, forms) with category filtering, and admin controls for adding, editing, and deleting documents via modals.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying key stats (active staff, shifts today, pending holidays, weekly shifts) and quick-action panels for pending holiday requests and today's schedule.",
  "frontend/src/pages/DocumentsPage.tsx": "Admin-facing documents management page with a full CRUD interface (add, edit, delete) for company documents, using a modal form with category, URL, and content fields.",
  "frontend/src/pages/EmployeeOfMonthPage.tsx": "Page for submitting and viewing Employee of the Month nominations, displaying a tally of votes, and allowing admins to declare a winner and mark their bonus as received.",
  "frontend/src/pages/EmployeePortalPage.tsx": "Employee self-service portal page that displays the current user's shifts and holiday requests, and allows them to submit new holiday requests. Admins/managers can also approve or decline requests from this view.",
  "frontend/src/pages/EmployeeProfilePage.tsx": "Displays a detailed profile page for a specific employee, including contact info and a tabbed interface for training, sickness, appraisals, manager notes, and badges.",
  "frontend/src/pages/EmployeesPage.tsx": "Lists all employees with search/filter functionality and allows admins to add new employees or edit existing ones via modal dialogs.",
  "frontend/src/pages/HolidayStatisticsPage.tsx": "Admin-only page showing holiday and sickness request statistics with summary counts, and the ability to approve or decline pending requests.",
  "frontend/src/pages/InventoryManagementPage.tsx": "Displays inventory items grouped by category in a table with stock counts, expiry dates, and order status indicators, with low-stock and expiry warnings highlighted.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login page with separate Admin (username/password) and Staff (Internet Identity) login flows, validating credentials and storing a session flag before triggering the identity login.",
  "frontend/src/pages/PayrollExportPage.tsx": "Admin-only page that aggregates shift and approved holiday data for a selected date range (current week, two-week, or custom) and exports a per-employee payroll CSV download.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Displays a holding screen informing a newly registered user that their account is awaiting admin approval, with a logout button.",
  "frontend/src/pages/ProfileSetupPage.tsx": "One-time profile setup form that collects the user's name, saves it via the backend mutation, and redirects to the employee portal on success.",
  "frontend/src/pages/ResourcesPage.tsx": "Displays a categorized list of company resources (logins, prices, forms, other) with admin controls to add, edit, and delete entries via a modal form.",
  "frontend/src/pages/SchedulingPage.tsx": "Weekly/daily shift scheduling calendar that allows admins to create, edit, and delete shifts (including leave and sickness types) and assign employees to them.",
  "frontend/src/pages/SecureResourcesPage.tsx": "Displays a confidential internal resources page grouped by category (logins, prices, forms, other), with admin-only add/edit/delete controls and a confidentiality warning banner.",
  "frontend/src/pages/StockRequestsPage.tsx": "A kanban-style stock request tracker with three columns (requested, ordered, delivered) supporting drag-and-drop status updates, form submission, and deletion, all managed in local component state.",
  "frontend/src/pages/TrainingSummaryPage.tsx": "Admin-only page that lists all active employees with their completed experience training badges, each row linking to the employee's profile page.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routing, persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a red/white/black brand theme with custom OKLCH color tokens, sidebar colors, box shadows, fonts, and animation keyframes.",
  "project_state.json": "Project state metadata describing the escape room staff/inventory management app, its existing features, architectural notes (red/white/black palette), and known issues like transparent dropdown backgrounds."
}