{
  "backend/main.mo": "Main Motoko actor for an HR management system defining types and state for employees, shifts, stock requests, to-do tasks, and access control, with public methods for user approval, profile management, and role-based authorization.",
  "feature_evidence.json": "Feature evidence report confirming that all overlay/popup components (modals, dropdowns, popovers, tooltips) have fully opaque backgrounds, with high confidence based on changes in frontend/src/index.css.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short summaries of each frontend source file, describing the purpose and key details of components, pages, hooks, and utilities in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for the design system's color tokens (background, foreground, primary, etc.) for both light and dark themes.",
  "frontend/index.html": "HTML entry point for the React app, mounting the root div and loading the main TypeScript module for the HR Database & Scheduling Tool.",
  "frontend/src/App.tsx": "Main React app component managing authentication state, page routing, admin bootstrap logic, and rendering the sidebar/header layout with all page components based on the current route.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog shown to new users prompting them to enter their full name to create a profile, using the useSaveCallerUserProfile mutation on submit.",
  "frontend/src/components/authorization/AccessDeniedScreen.tsx": "Full-screen access denied component displayed when a user lacks permission for a page, with a button to navigate back to the Employee Portal.",
  "frontend/src/components/documents/AddDocumentModal.tsx": "Modal dialog for adding a new document with fields for title, description, category, file URL, inline content, and employee visibility toggle.",
  "frontend/src/components/documents/EditDocumentModal.tsx": "Modal dialog for editing an existing document's title, description, category, file URL, content, and visibility using a form with controlled inputs and the useUpdateDocument mutation.",
  "frontend/src/components/employees/AddEmployeeModal.tsx": "Modal dialog for creating a new employee record with fields for name, job title, department, email, phone, start date, and role, using the useAddEmployee mutation.",
  "frontend/src/components/employees/ConfirmDeactivateDialog.tsx": "Alert dialog that confirms activating or deactivating an employee, toggling their isActive status via the useUpdateEmployee mutation.",
  "frontend/src/components/employees/EditEmployeeModal.tsx": "Modal dialog for editing an existing employee's details including name, job title, department, contact info, start date, and account level using the useUpdateEmployee mutation.",
  "frontend/src/components/employees/EmployeeTable.tsx": "Renders a table of employees with columns for name, job title, department, start date, and status, plus action buttons to view, edit, or deactivate/reactivate each employee.",
  "frontend/src/components/inventory/EditInventoryItemModal.tsx": "Modal dialog for editing an inventory item's fields such as name, category, supplier, stock counts, order status, dates, price, and size using the useUpdateInventoryItem mutation.",
  "frontend/src/components/layout/Header.tsx": "Top navigation header component displaying the current page title, a notification bell, user info (name/admin badge), and a logout button using Internet Identity.",
  "frontend/src/components/layout/Layout.tsx": "Stub/legacy layout component kept for backward compatibility that renders nothing; the app now uses MainLayout directly.",
  "frontend/src/components/layout/MainLayout.tsx": "Root layout shell that composes the Sidebar and Header around a scrollable main content area, passing navigation and user props to each.",
  "frontend/src/components/layout/Sidebar.tsx": "Left navigation sidebar with grouped nav items (Overview, People, Recognition, Resources, Operations, Finance, Admin), filtering admin-only items based on the isAdmin prop.",
  "frontend/src/components/profile/AddAppraisalModal.tsx": "Modal dialog for scheduling a new employee appraisal, with fields for date, type (annual/mid-year/probationary), notes, and completion status.",
  "frontend/src/components/profile/AddManagerNoteModal.tsx": "Modal dialog for adding a typed manager note (general, concern, sickness, performance) to an employee record, attributed to the current manager's employee ID.",
  "frontend/src/components/profile/AddSicknessModal.tsx": "Modal dialog for logging an employee sickness absence with start/end dates, reason, and a return-to-work note.",
  "frontend/src/components/profile/AddTrainingModal.tsx": "Modal dialog for adding a training record to an employee, allowing selection from a predefined list of experience names or a custom title, with status and optional completion/expiry dates.",
  "frontend/src/components/profile/AppraisalsTab.tsx": "Displays a list of appraisal records for an employee with sorting, status badges, and buttons to add or edit appraisals via modals.",
  "frontend/src/components/profile/AssignBadgeModal.tsx": "Modal dialog for searching and selecting an achievement badge to assign to an employee, with an optional note field and grouped badge display by category.",
  "frontend/src/components/profile/BadgesTab.tsx": "Displays all achievement badges assigned to an employee in a grid, with admin controls to assign new badges or remove existing ones.",
  "frontend/src/components/profile/EditAppraisalModal.tsx": "Modal form for editing an appraisal record by creating a new corrected entry (workaround for missing update API), with fields for date, type, notes, and completion status.",
  "frontend/src/components/profile/EditManagerNoteModal.tsx": "Modal dialog for editing an existing manager note, allowing updates to the note type and content via a form with validation.",
  "frontend/src/components/profile/EditSicknessModal.tsx": "Modal form for editing a sickness record by submitting a new corrected entry (workaround for missing update API), with fields for start/end dates, reason, and return note.",
  "frontend/src/components/profile/EditTrainingModal.tsx": "A modal dialog for editing an existing training record, allowing users to update the title (from a predefined list or custom), description, status, completion date, and expiry date.",
  "frontend/src/components/profile/ManagerNotesTab.tsx": "Displays a filterable list of manager notes for a given employee, with support for adding, editing, and deleting notes via modals.",
  "frontend/src/components/profile/SicknessTab.tsx": "Displays sickness/absence records for an employee with total days absent, and provides modals for adding and editing records.",
  "frontend/src/components/profile/TrainingTab.tsx": "Displays a list of training records for an employee with status badges and expiry warnings, and allows admins to add, edit, or delete records.",
  "frontend/src/components/resources/AddResourceModal.tsx": "A modal form for creating a new secure resource with fields for title, category, content/URL, and a restricted-access toggle.",
  "frontend/src/components/resources/EditResourceModal.tsx": "A modal form for editing an existing resource, pre-populated with the resource's current title, category, content, and restricted status.",
  "frontend/src/components/scheduling/AddShiftModal.tsx": "Modal dialog for creating a new shift, allowing the user to set date, time, department, and assign employees, then submitting via the useAddShift mutation.",
  "frontend/src/components/scheduling/EditShiftModal.tsx": "Modal dialog for editing an existing shift by pre-populating form fields from the shift data and creating a new shift record (since no update endpoint exists) via useAddShift.",
  "frontend/src/components/scheduling/ShiftCard.tsx": "Compact card component displaying a shift's department, time range, and assigned employees, with hover-revealed edit and view action buttons.",
  "frontend/src/components/scheduling/ShiftDetailModal.tsx": "Modal showing full shift details including assigned employees and shift notes, with support for adding and inline-editing notes via useGetShiftNotes and useAddShiftNote.",
  "frontend/src/components/scheduling/WeeklyCalendar.tsx": "Renders a 7-column weekly calendar grid, filtering and sorting shifts per day and displaying them as ShiftCard components with today and weekend highlighting.",
  "frontend/src/components/todos/CreateTaskModal.tsx": "Modal form for creating a to-do task with fields for title, description, duration, assignee (everyone or specific employee), and recurrence (none or weekly), submitted via useCreateTask.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, including login, logout, and identity state management using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks (queries and mutations) for interacting with the backend actor, covering auth, employees, training, shifts, holidays, inventory, badges, and more.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, imports fonts, defines a red/white/black themed CSS variable palette for light and dark modes, and applies opaque backgrounds to Radix UI overlay components.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging, ID generation, nanosecond/date conversions, date formatting, expiry checks, and other common helpers used across the frontend.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminApprovalQueuePage.tsx": "Admin page that displays pending, approved, and rejected user access requests, allowing admins to approve or reject users via the setApproval mutation.",
  "frontend/src/pages/AppraisalsDashboardPage.tsx": "Displays an admin-only dashboard listing all active employees with their appraisal status (overdue, due soon, or up to date) based on the last completed appraisal, with navigation to individual employee profiles.",
  "frontend/src/pages/CompanyDocumentsPage.tsx": "Renders a filterable grid of company documents (handbooks, policies, forms, etc.) with admin controls to add, edit, and delete documents via modals.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing today's tasks, employee stats, shifts, and holiday requests, with task completion functionality and navigation to other pages for both admin and regular users.",
  "frontend/src/pages/DocumentsPage.tsx": "Admin-facing documents management page with a modal form for creating and editing documents (title, category, URL, content) and the ability to delete them.",
  "frontend/src/pages/EmployeeOfMonthPage.tsx": "Page for submitting and viewing Employee of the Month nominations, with admin controls to set the monthly winner and mark their bonus as received.",
  "frontend/src/pages/EmployeePortalPage.tsx": "Employee self-service portal page that displays the current user's shifts and holiday requests, and allows them to submit new holiday requests. Admins/managers can also approve or decline requests from this view.",
  "frontend/src/pages/EmployeeProfilePage.tsx": "Displays a detailed profile page for a specific employee, including contact info, role badge, and tabbed sections for training, sickness, appraisals, manager notes, and badges.",
  "frontend/src/pages/EmployeesPage.tsx": "Lists all employees with search/filter functionality and allows admins to add new employees or edit existing ones via modal dialogs.",
  "frontend/src/pages/HolidayStatisticsPage.tsx": "Admin-only page showing holiday and sickness request statistics with summary counts, total approved days, and the ability to approve or decline pending requests.",
  "frontend/src/pages/InventoryManagementPage.tsx": "Displays inventory items grouped by category with stock level indicators and expiry status, allowing admins to edit items via a modal.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login page with separate admin (username/password) and staff (Internet Identity) login flows, validating credentials and storing a session flag before triggering authentication.",
  "frontend/src/pages/PayrollExportPage.tsx": "Admin-only page that aggregates shift and approved holiday data for a selected date range and exports a per-employee payroll summary as a CSV download.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Displays a holding screen informing newly registered users that their account is awaiting admin approval, with a logout button.",
  "frontend/src/pages/ProfileSetupPage.tsx": "One-time profile setup form that collects a new user's full name, saves it via mutation, and redirects to the employee portal on success.",
  "frontend/src/pages/ResourcesPage.tsx": "Displays a categorized list of company resources (logins, prices, forms, other) with admin controls to add, edit, and delete entries via modal dialogs.",
  "frontend/src/pages/SchedulingPage.tsx": "Weekly/daily shift scheduling page that lets admins create, edit, and delete shifts (including leave and sickness types) and assign employees, with week navigation controls.",
  "frontend/src/pages/SecureResourcesPage.tsx": "Displays confidential internal resources grouped by category (logins, prices, forms, other) with admin-only add/edit/delete controls and a confidentiality warning banner.",
  "frontend/src/pages/StockRequestArchivePage.tsx": "Shows a read-only table of archived (delivered) stock requests sorted by most recent, fetched via useGetArchivedStockRequests, with loading skeletons and empty/error states.",
  "frontend/src/pages/StockRequestsPage.tsx": "Kanban-style stock request board with three status columns (Requested, Ordered, Delivered), supporting drag-and-drop status changes, new request creation, and archiving delivered items.",
  "frontend/src/pages/ToDoPage.tsx": "Task management page that lists recurring and one-off to-do tasks with assignee, duration, and recurrence info, allowing staff to mark tasks complete and admins to create new ones.",
  "frontend/src/pages/TrainingSummaryPage.tsx": "Admin-only page that lists all active employees with badges showing which experiences they have completed training for, linking through to individual employee profiles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, a brand color palette (reds, blacks, whites in OKLCH), border radii, box shadows, and animation keyframes for the frontend.",
  "project_state.json": "Project state metadata tracking an existing fix feature and a pending request to ensure all popup/overlay components have fully opaque, non-transparent backgrounds."
}