{
  "backend/main.mo": "Main Motoko actor for the HR backend, defining all data types (Employee, TrainingRecord, SicknessRecord, etc.) and exposing query/update methods for user profiles, access control, and user approval workflows.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (colour scheme, sidebar fix, login system, privilege levels, etc.) to their relevant source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON catalogue of short descriptions for each frontend source file, covering modals, pages, hooks, and utility modules used across the React application.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes, including background, foreground, primary, sidebar, and chart colour variables.",
  "frontend/index.html": "HTML shell for the React SPA, setting the page title to 'HR Database & Scheduling Tool' and mounting the app at the `#root` div via `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React component managing authentication state via Internet Identity, page routing through a state machine, and conditional rendering of login, pending-approval, profile-setup, and main layout views.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog shown to newly authenticated users to collect their full name, save their profile, and submit an approval request before they can access the dashboard.",
  "frontend/src/components/authorization/AccessDeniedScreen.tsx": "Full-page access-denied screen displaying a shield icon and message, with a button to navigate back to the Employee Portal.",
  "frontend/src/components/documents/AddDocumentModal.tsx": "Modal dialog for creating a new document with fields for title, description, category, file URL, content, and visibility toggle, using the useAddDocument mutation hook.",
  "frontend/src/components/documents/EditDocumentModal.tsx": "Modal dialog for editing an existing document, pre-populated with the document's current values and using the useUpdateDocument mutation hook to save changes.",
  "frontend/src/components/employees/AddEmployeeModal.tsx": "Modal dialog for adding a new employee with fields for personal/job info and an admin-only role selector, using the useAddEmployee mutation hook.",
  "frontend/src/components/employees/ConfirmDeactivateDialog.tsx": "Alert dialog that confirms toggling an employee's active/inactive status, calling useUpdateEmployee to apply the change.",
  "frontend/src/components/employees/EditEmployeeModal.tsx": "Modal dialog for editing an existing employee's details, pre-populated with current values and using the useUpdateEmployee mutation hook, with an admin-only role selector.",
  "frontend/src/components/employees/EmployeeTable.tsx": "Renders a table of employees with columns for name, job title, department, start date, and status, plus action buttons for viewing, editing, and toggling active status.",
  "frontend/src/components/layout/Header.tsx": "Top navigation header component displaying the app title, current user's name/role, and a logout button that clears identity and query cache.",
  "frontend/src/components/layout/Layout.tsx": "Deprecated stub file kept for backward compatibility; renders nothing and is no longer used as the main layout.",
  "frontend/src/components/layout/MainLayout.tsx": "Main application shell that composes Sidebar and Header around a scrollable content area, with collapsible sidebar state management.",
  "frontend/src/components/layout/Sidebar.tsx": "Collapsible navigation sidebar that renders grouped nav items filtered by user role (admin/manager/employee), with icons and active-page highlighting.",
  "frontend/src/components/profile/AddAppraisalModal.tsx": "Modal dialog for scheduling a new appraisal record for an employee, with fields for date, type, notes, and completion status.",
  "frontend/src/components/profile/AddManagerNoteModal.tsx": "Modal dialog for adding a typed manager note (general, concern, sickness, performance) to an employee's profile.",
  "frontend/src/components/profile/AddSicknessModal.tsx": "Modal dialog for recording an employee sickness absence with start/end dates, reason, and return-to-work note.",
  "frontend/src/components/profile/AddTrainingModal.tsx": "Modal dialog for adding a training record to an employee profile, including title, description, completion/expiry dates, and status.",
  "frontend/src/components/profile/AppraisalsTab.tsx": "Displays a list of appraisal records for an employee with options to add or edit entries, showing type badges and completion status. Uses loading skeletons and sorts records by scheduled date descending.",
  "frontend/src/components/profile/EditAppraisalModal.tsx": "Modal dialog for editing an appraisal record by creating a new entry (since the backend lacks an update endpoint), with fields for date, type, notes, and completion status.",
  "frontend/src/components/profile/EditManagerNoteModal.tsx": "Modal dialog for editing an existing manager note, allowing updates to note type and content via the updateManagerNote mutation.",
  "frontend/src/components/profile/EditSicknessModal.tsx": "Modal dialog for editing a sickness record by adding a new corrected entry (workaround for missing backend update endpoint), with fields for start/end dates, reason, and return note.",
  "frontend/src/components/profile/EditTrainingModal.tsx": "Modal dialog for editing an existing training record with fields for title, description, completion/expiry dates, and status, using the updateTrainingRecord mutation.",
  "frontend/src/components/profile/ManagerNotesTab.tsx": "Displays filterable manager notes for an employee with add, edit, and delete capabilities, showing note type badges, author names, and creation dates sorted newest first.",
  "frontend/src/components/profile/SicknessTab.tsx": "Displays a list of sickness/absence records for an employee with total days absent, and provides buttons to add or edit records via modals.",
  "frontend/src/components/profile/TrainingTab.tsx": "Displays training and knowledge records for an employee with status badges and expiry warnings, and supports adding or editing records via modals.",
  "frontend/src/components/resources/AddResourceModal.tsx": "Modal form for creating a new secure resource with title, category, content, and restricted-access toggle fields.",
  "frontend/src/components/resources/EditResourceModal.tsx": "Modal form for editing an existing resource, pre-populated with the resource's current values and saving changes via the updateResource mutation.",
  "frontend/src/components/scheduling/AddShiftModal.tsx": "Modal form for creating a new shift with date, time, department, and multi-employee assignment via badge selection.",
  "frontend/src/components/scheduling/EditShiftModal.tsx": "Modal form for editing an existing shift by pre-populating its fields; saves changes by creating a new shift record since the backend lacks an updateShift endpoint.",
  "frontend/src/components/scheduling/ShiftCard.tsx": "Renders a compact shift card showing department, time, and assigned employees with hover-revealed edit and view action buttons. Uses a hash-based color system to assign distinct colors per department.",
  "frontend/src/components/scheduling/ShiftDetailModal.tsx": "A dialog modal that displays full shift details including assigned employees and shift notes, with support for adding and editing notes via an inline form.",
  "frontend/src/components/scheduling/WeeklyCalendar.tsx": "Renders a 7-column weekly calendar grid where each column shows a day's shifts using ShiftCard components, with visual highlights for today and weekends.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login, logout, and status tracking via a React context and AuthClient, including a provider component and consumer hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data, covering entities such as employees, shifts, holidays, documents, and user roles/approvals.",
  "frontend/src/index.css": "Global stylesheet that configures Tailwind CSS, imports Inter and Bebas Neue fonts, defines dark-theme CSS custom properties, and adds a thin scrollbar utility class.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging, ID generation, nanosecond timestamp conversions, date/time formatting, and currency formatting used throughout the frontend.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AdminApprovalQueuePage.tsx": "Admin-only page that lists pending, approved, and rejected user access requests, allowing admins to approve or reject them via the backend.",
  "frontend/src/pages/AppraisalsDashboardPage.tsx": "Admin-only dashboard listing all active employees with their last and next due appraisal dates, highlighting overdue or upcoming appraisals.",
  "frontend/src/pages/CompanyDocumentsPage.tsx": "Page for viewing, filtering, adding, editing, and deleting company documents (handbooks, policies, forms) with admin-gated write actions.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing summary stats (active staff, today's shifts, pending holidays, weekly shifts) and quick-action panels for admins.",
  "frontend/src/pages/DocumentsPage.tsx": "Displays a list of company documents with category filtering and supports admin CRUD operations (add, edit, delete) via a modal dialog form.",
  "frontend/src/pages/EmployeeOfMonthPage.tsx": "Shows the current month's Employee of the Month winner and nomination tally, allowing employees to submit nominations and admins to declare a winner and mark bonuses.",
  "frontend/src/pages/EmployeePortalPage.tsx": "Employee self-service portal displaying the caller's upcoming shifts and holiday requests, with the ability to submit new paid/unpaid holiday requests and approve/decline them if manager or admin.",
  "frontend/src/pages/EmployeeProfilePage.tsx": "Detailed profile page for a single employee showing tabbed sections for training records, sickness records, appraisals, and manager notes, with modal forms for admins to add or delete each record type.",
  "frontend/src/pages/EmployeesPage.tsx": "Lists all employees with search filtering and supports admin actions to add new employees or edit existing ones via modal dialogs, with navigation to individual employee profile pages.",
  "frontend/src/pages/HolidayStatisticsPage.tsx": "Admin-only page that displays holiday/sickness request statistics (pending, approved, declined counts and total approved days) and allows admins to approve or decline individual requests.",
  "frontend/src/pages/InventoryManagementPage.tsx": "Local-state inventory management page where users can add, edit, and delete stock items with per-location quantities and expiry dates, highlighting expired or soon-to-expire items.",
  "frontend/src/pages/LoginPage.tsx": "Login page offering two paths: an admin form with hardcoded username/password credentials and a staff Internet Identity login button, both triggering the useInternetIdentity login flow.",
  "frontend/src/pages/PayrollExportPage.tsx": "Admin-only page that aggregates shift and approved holiday data for a selected date range (current week, two-week, or custom) and exports a per-employee payroll CSV breakdown.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Informational page shown to authenticated users whose accounts are awaiting admin approval, with a logout button to clear the session.",
  "frontend/src/pages/ProfileSetupPage.tsx": "One-time profile setup page that prompts a newly authenticated user to enter their full name, saves it via the useSaveCallerUserProfile mutation, then redirects to the employee portal.",
  "frontend/src/pages/ResourcesPage.tsx": "A page for managing internal resources (logins, prices, forms, etc.) with add/edit/delete functionality via modals, restricted to admins for mutations, using React Query hooks and toast notifications.",
  "frontend/src/pages/SchedulingPage.tsx": "A weekly/daily shift scheduling page that allows admins to add, edit, and delete shifts with employee assignments, supporting shift types like regular, paid leave, unpaid leave, and sickness.",
  "frontend/src/pages/SecureResourcesPage.tsx": "A read-focused secure resources page that displays confidential staff resources grouped by category, with admin-only add/edit/delete actions delegated to separate modal components.",
  "frontend/src/pages/StockRequestsPage.tsx": "A Kanban-style stock request tracker with drag-and-drop support across requested/ordered/delivered columns, using local state only (no backend persistence).",
  "frontend/src/pages/TrainingSummaryPage.tsx": "An admin-only page that lists all active employees with their completed experience training badges, linking to individual employee profiles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with oklch CSS variable-based colors, custom fonts (Inter, Bebas Neue), border radii, accordion animations, and typography/animate plugins.",
  "project_state.json": "Project state manifest describing an HR/company dashboard for an entertainment venue, tracking implemented features, architectural notes, known issues, and versioning metadata."
}