{
  "backend/main.mo": "Main Motoko actor defining all backend types, state, and public API for an HR management system including stock requests, to-do tasks, user profiles, access control, and user approval logic.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (stock requests page, React Query hooks, kanban dashboard) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, serving as a reference for what each component, page, hook, and utility does.",
  "frontend/index.css": "Global CSS file importing Tailwind directives and defining CSS custom properties for light and dark theme color tokens used throughout the UI.",
  "frontend/index.html": "Minimal HTML entry point titled 'HR Database & Scheduling Tool' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component managing authentication state, page routing, admin bootstrap flow, and rendering all page components within a QueryClientProvider and layout shell.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog shown to new users prompting them to enter their full name to create a profile before accessing the app.",
  "frontend/src/components/authorization/AccessDeniedScreen.tsx": "Full-page access denied screen with a shield icon and a button to return to the Employee Portal, shown when a user lacks permission for a route.",
  "frontend/src/components/documents/AddDocumentModal.tsx": "Modal dialog for creating a new document with fields for title, description, category, file URL, content, and visibility toggle, using the useAddDocument mutation hook.",
  "frontend/src/components/documents/EditDocumentModal.tsx": "Modal dialog for editing an existing document, pre-populated with the document's current values and using the useUpdateDocument mutation hook to save changes.",
  "frontend/src/components/employees/AddEmployeeModal.tsx": "Modal dialog for adding a new employee with fields for personal info, start date, active status, and role (admin-only role selector), using the useAddEmployee mutation hook.",
  "frontend/src/components/employees/ConfirmDeactivateDialog.tsx": "Alert dialog that confirms toggling an employee's active/inactive status, calling useUpdateEmployee to apply the change.",
  "frontend/src/components/employees/EditEmployeeModal.tsx": "Modal dialog for editing an existing employee's details, pre-populated with current values and using the useUpdateEmployee mutation hook to persist updates.",
  "frontend/src/components/employees/EmployeeTable.tsx": "Renders a paginated table of employees with columns for name, job title, department, start date, and status, plus action buttons for viewing, editing, and deactivating each employee.",
  "frontend/src/components/layout/Header.tsx": "Top navigation header component displaying the current page title, a notification bell, user info (name/admin badge), and a logout button using Internet Identity.",
  "frontend/src/components/layout/Layout.tsx": "Stub/legacy layout component kept for backward compatibility that renders nothing; the app now uses MainLayout directly.",
  "frontend/src/components/layout/MainLayout.tsx": "Root layout shell that composes the Sidebar and Header around a scrollable main content area, passing navigation and user props to each.",
  "frontend/src/components/layout/Sidebar.tsx": "Left navigation sidebar with grouped nav items (Overview, People, Recognition, Resources, Operations, Finance, Admin), filtering admin-only items based on the isAdmin prop.",
  "frontend/src/components/profile/AddAppraisalModal.tsx": "Modal dialog for scheduling an employee appraisal, with fields for date, type (annual/mid-year/probationary), notes, and completion status, submitted via the useAddAppraisalRecord mutation.",
  "frontend/src/components/profile/AddManagerNoteModal.tsx": "Modal dialog for adding a typed manager note (general, concern, sickness, performance) to an employee record, submitted via the useAddManagerNote mutation.",
  "frontend/src/components/profile/AddSicknessModal.tsx": "Modal dialog for logging an employee sickness absence with start/end dates, reason, and return-to-work note, submitted via the useAddSicknessRecord mutation.",
  "frontend/src/components/profile/AddTrainingModal.tsx": "Modal dialog for adding a training record to an employee profile, capturing title, description, completion/expiry dates, and status, submitted via the useAddTrainingRecord mutation.",
  "frontend/src/components/profile/AppraisalsTab.tsx": "Displays a list of appraisal records for an employee with sorting, status badges, and buttons to add or edit appraisals via modals.",
  "frontend/src/components/profile/AssignBadgeModal.tsx": "Modal dialog for searching and selecting an achievement badge to assign to an employee, with an optional note field and grouped badge display by category.",
  "frontend/src/components/profile/BadgesTab.tsx": "Displays all achievement badges assigned to an employee in a grid, with admin controls to assign new badges or remove existing ones.",
  "frontend/src/components/profile/EditAppraisalModal.tsx": "Modal form for editing an appraisal record that works around the lack of an update API by creating a new record with the modified values.",
  "frontend/src/components/profile/EditManagerNoteModal.tsx": "Modal dialog for editing an existing manager note's type and content, using the updateManagerNote mutation to persist changes.",
  "frontend/src/components/profile/EditSicknessModal.tsx": "Modal form for editing a sickness record that works around the lack of an update API by submitting a new corrected record with the modified dates and notes.",
  "frontend/src/components/profile/EditTrainingModal.tsx": "A dialog modal for editing an existing training record, allowing updates to title, description, completion/expiry dates, and status via a form with validation and toast notifications.",
  "frontend/src/components/profile/ManagerNotesTab.tsx": "Displays a filterable list of manager notes for an employee with options to add, edit, and delete notes, showing note type badges and author names.",
  "frontend/src/components/profile/SicknessTab.tsx": "Displays an employee's sickness/absence records sorted by date with total days summary, and provides modals to add or edit records.",
  "frontend/src/components/profile/TrainingTab.tsx": "Displays an employee's training records with status badges and expiry warnings, and provides modals to add or edit training entries.",
  "frontend/src/components/resources/AddResourceModal.tsx": "A dialog modal for creating a new secure resource with fields for title, category, content, and a restricted-access toggle.",
  "frontend/src/components/resources/EditResourceModal.tsx": "A dialog modal for editing an existing resource's title, category, content, and restricted-access setting, pre-populated with the current resource data.",
  "frontend/src/components/scheduling/AddShiftModal.tsx": "Modal dialog for creating a new shift, allowing the user to set date, time, department, and assign employees, then submitting via the useAddShift mutation.",
  "frontend/src/components/scheduling/EditShiftModal.tsx": "Modal dialog for editing an existing shift by pre-populating form fields from the shift data and creating a new shift record (since no update endpoint exists) via useAddShift.",
  "frontend/src/components/scheduling/ShiftCard.tsx": "Compact card component displaying a shift's department, time range, and assigned employees, with hover-revealed edit and view action buttons.",
  "frontend/src/components/scheduling/ShiftDetailModal.tsx": "Modal that shows full shift details including assigned employees and shift notes, with the ability to add or inline-edit notes via useAddShiftNote.",
  "frontend/src/components/scheduling/WeeklyCalendar.tsx": "Renders a 7-column weekly calendar grid, filtering and sorting shifts per day and displaying them as ShiftCard components with today and weekend highlighting.",
  "frontend/src/components/todos/CreateTaskModal.tsx": "Modal form for creating a new to-do task with fields for title, description, duration, assignee (everyone or specific employee), and recurrence (none or weekly), submitted via useCreateTask.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, and invalidates all dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, including login, logout, and identity state management using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (queries and mutations) for all backend actor interactions, covering auth, user profiles, employees, shifts, holidays, inventory, badges, and more.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, imports fonts, defines a red/white/black escape-room theme with CSS custom properties for light and dark modes, and adds scrollbar styling.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging, ID generation, nanosecond timestamp conversions, date formatting, week calculation, and expiry checks.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminApprovalQueuePage.tsx": "Admin page that displays pending, approved, and rejected user access requests, allowing admins to approve or reject users via mutation hooks.",
  "frontend/src/pages/AppraisalsDashboardPage.tsx": "Admin-only dashboard page that lists all active employees with their appraisal status (overdue, due soon, or up to date) based on the last completed appraisal, and navigates to individual employee profiles.",
  "frontend/src/pages/CompanyDocumentsPage.tsx": "Page for browsing company documents (handbooks, policies, forms) with category filtering, and admin controls for adding, editing, and deleting documents via modals.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing today's tasks, employee stats, shifts, and holiday requests, with task completion functionality and navigation to other app sections.",
  "frontend/src/pages/DocumentsPage.tsx": "Admin-facing documents management page with a full CRUD interface (add, edit, delete) for company documents using an inline modal form and category-based display.",
  "frontend/src/pages/EmployeeOfMonthPage.tsx": "Page for submitting and viewing Employee of the Month nominations, displaying a tally of votes, and allowing admins to declare a winner and mark bonus receipt.",
  "frontend/src/pages/EmployeePortalPage.tsx": "Employee self-service portal page that displays the current user's shifts and holiday requests, and allows them to submit new holiday requests. Managers/admins can also approve or decline requests from this page.",
  "frontend/src/pages/EmployeeProfilePage.tsx": "Displays a detailed profile page for a specific employee, including contact info and a tabbed interface for training, sickness, appraisals, manager notes, and badges. Supports navigation back to the employees list.",
  "frontend/src/pages/EmployeesPage.tsx": "Lists all employees with search/filter functionality and allows admins to add new employees or edit existing ones via modal dialogs. Provides navigation to individual employee profile pages.",
  "frontend/src/pages/HolidayStatisticsPage.tsx": "Admin-only page showing holiday and sickness request statistics with summary counts for pending, approved, and declined requests. Allows admins to approve or decline pending requests inline.",
  "frontend/src/pages/InventoryManagementPage.tsx": "Displays inventory items grouped by category in a table with stock counts, expiry dates, and order status indicators. Highlights low-stock and expiring/expired items with visual badges and warnings.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login page with separate Admin (username/password) and Staff (Internet Identity) login flows, validating credentials and storing a session flag before triggering authentication.",
  "frontend/src/pages/PayrollExportPage.tsx": "Admin-only page that aggregates shift and approved holiday data for a selected date range and exports a per-employee payroll summary as a CSV download.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Displays a holding screen informing newly registered users that their account is awaiting admin approval, with a logout button.",
  "frontend/src/pages/ProfileSetupPage.tsx": "One-time profile setup form that collects a new user's full name, saves it via the backend mutation, and redirects to the employee portal.",
  "frontend/src/pages/ResourcesPage.tsx": "Displays a categorized list of company resources (logins, prices, forms, other) with admin controls to add, edit, and delete entries via a modal form.",
  "frontend/src/pages/SchedulingPage.tsx": "Weekly/daily shift scheduling calendar that allows admins to create, edit, and delete shifts (including leave and sickness types) with employee assignment support.",
  "frontend/src/pages/SecureResourcesPage.tsx": "Displays confidential internal resources grouped by category (logins, prices, forms, other) with admin-only add/edit/delete controls and a confidentiality warning banner.",
  "frontend/src/pages/StockRequestArchivePage.tsx": "Shows a read-only table of archived (delivered) stock requests sorted by most recent, fetched via useGetArchivedStockRequests, with loading skeletons and empty/error states.",
  "frontend/src/pages/StockRequestsPage.tsx": "Kanban-style stock request board with three status columns (Requested, Ordered, Delivered), supporting drag-and-drop status changes, new request creation, and archiving delivered items.",
  "frontend/src/pages/ToDoPage.tsx": "Renders a list of to-do tasks with assignee, recurrence, and completion status, allowing admins to create tasks and any user to mark tasks complete via useMarkTaskComplete.",
  "frontend/src/pages/TrainingSummaryPage.tsx": "Admin-only page listing all active employees with badges showing which experiences they have completed training for, linking through to individual employee profiles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage support for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with brand colors (red/black/white in OKLCH), typography, sidebar, shadow, animation, and plugin settings for an escape room management app.",
  "project_state.json": "Project state manifest describing an escape room/venue management hub, tracking existing features, architectural notes, known issues, and versioning for features like stock requests, task management, and employee database."
}