{
  "kind": "build_request",
  "title": "UI colour overhaul (red/white/black theme + dropdown fix) & staff gamification badges",
  "projectName": "The Panic Room Staff Hub",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restyle the entire application with a bold red, white, and black colour scheme that fits an Escape Room brand. Replace the current plain monochrome palette with a rich theme: use deep/vivid reds as primary accent colours, clean white for content surfaces, and black/near-black for backgrounds and sidebars. Apply this consistently across the header, sidebar, navigation items, buttons, badges, stat cards, page backgrounds, tables, and form controls. Typography and iconography should also reflect this palette. The result should feel immersive and on-brand — energetic but readable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The whole app looks very plain at the minute and is only white and black, please incoporate a wider and better use of colours including red, white and black."
        ]
      },
      "acceptanceCriteria": [
        "Red is used as the primary accent across buttons, active nav items, badges, and key UI highlights",
        "The sidebar and header use a dark black or near-black background with white/red text and icons",
        "Content areas (cards, tables, modals) use white or off-white backgrounds with dark text for readability",
        "All pages are visually consistent — no page retains the old plain white/black-only look",
        "Text contrast meets readability standards on all coloured backgrounds"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix all dropdown and select menus so their background is a solid colour rather than transparent. Dropdowns (e.g. role selects, category filters, date pickers, status selects in forms and tables) must display an opaque background that matches the updated theme — either white/off-white for light surfaces or the dark background for dark surfaces. The dropdown must be fully readable regardless of what is rendered behind it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "drop downs background are transparent, they need to have a solid colour"
        ]
      },
      "acceptanceCriteria": [
        "Every select/dropdown in the app shows a fully opaque, solid-colour background when opened",
        "No dropdown appears transparent or see-through over page content",
        "Dropdown option text is legible against the solid background",
        "Fix applies to all pages including forms, filters, modals, and table controls"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a gamification badge system to the backend. Define a `Badge` type with fields: id (Text), name (Text), description (Text), category (Text — e.g. 'Attendance', 'Performance', 'Experience', 'Customer', 'Team'), iconKey (Text — a key referencing a frontend icon/emoji), and createdAt (Int). Define a `StaffBadge` type representing an assignment with fields: id (Text), employeeId (Text), badgeId (Text), assignedBy (Text — manager's employeeId), assignedAt (Int), and note (opt Text). Store badges in a stable `HashMap<Text, Badge>` and staff badge assignments in a stable `HashMap<Text, StaffBadge>`. Seed a set of initial badges appropriate for an Escape Room Company (see REQ-4 for the badge list). Expose backend methods: `getBadges() → async [Badge]`, `addBadge(badge: Badge) → async Result`, `getStaffBadges(employeeId: Text) → async [StaffBadge]`, `assignBadgeToStaff(assignment: StaffBadge) → async Result` (manager/admin only), `removeBadgeFromStaff(assignmentId: Text) → async Result` (manager/admin only).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add Gamification to staff profiles which managers can assign to staff (badges for perfect attendance, positive feedback, good review etc.)"
        ]
      },
      "acceptanceCriteria": [
        "Badge and StaffBadge types are defined in main.mo",
        "Stable HashMaps persist badge definitions and staff badge assignments across upgrades",
        "getBadges returns all available badges",
        "getStaffBadges returns all badge assignments for a given employee",
        "assignBadgeToStaff is restricted to manager and admin callers",
        "removeBadgeFromStaff is restricted to manager and admin callers",
        "Initial badge seed data is present on first deploy"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Seed the following themed badges appropriate for The Panic Room (Escape Rooms, birthday parties, axe throwing, laser tag, TV Game Show Experiences). Each badge should have a name, short description, category, and an emoji iconKey. Include at minimum: **Attendance & Reliability** — 'Perfect Attendance' (zero absences in a period), 'Early Bird' (consistently early to shifts), 'Reliable Hero' (never missed a shift); **Performance & Reviews** — 'Five Star Review' (received an outstanding customer review), 'Crowd Favourite' (multiple positive feedback submissions), 'Top Performer' (excellent appraisal score); **Experience-Specific** — 'Escape Master' (specialist in escape room experiences), 'Party Starter' (exceptional birthday party host), 'Axe Legend' (top-rated axe throwing guide), 'Laser Commander' (laser tag expert), 'Game Show Star' (TV Game Show experience specialist); **Team & Culture** — 'Team Player' (recognised by peers for collaboration), 'Mentorship Badge' (helped train a new team member), 'Going the Extra Mile' (above-and-beyond effort recognised by a manager); **Milestones** — '1 Year Anniversary', '3 Year Anniversary', '5 Year Anniversary'.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "badges for perfect attendance, positive feedback, good review etc.",
          "Escape Room Company that also does birthday parties, axe throwing, laser tag and TV Game Show Experiences"
        ]
      },
      "acceptanceCriteria": [
        "All seeded badges are available via getBadges on first deploy",
        "Badges span at least the categories: Attendance, Performance, Experience, Team, Milestones",
        "Each badge has a name, description, category, and emoji iconKey"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add a 'Badges' tab to the Employee Profile page (`EmployeeProfilePage.tsx`). This tab should display all badges currently assigned to the employee as visual badge cards — each showing the badge emoji, name, description, category colour chip, date assigned, assigning manager's name, and optional note. When the viewer is a manager or admin, show an 'Assign Badge' button that opens a modal (`AssignBadgeModal`) allowing them to select a badge from the full badge list (grouped by category), optionally add a note, and confirm the assignment. Managers/admins should also be able to remove an assigned badge via a remove button on each badge card. Use the new React Query hooks for `getStaffBadges` and `assignBadgeToStaff` and `removeBadgeFromStaff`. Style badge cards using the red/white/black theme with category-coloured accents.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add Gamification to staff profiles which managers can assign to staff",
          "badges for perfect attendance, positive feedback, good review etc."
        ]
      },
      "acceptanceCriteria": [
        "A 'Badges' tab appears on the Employee Profile page alongside existing tabs",
        "Assigned badges render as styled cards with emoji, name, description, category, assigned date, assigning manager, and note",
        "Managers and admins see an 'Assign Badge' button; regular employees do not",
        "The assign badge modal shows all available badges grouped by category with a search or scroll",
        "Assigning a badge updates the display immediately via React Query cache invalidation",
        "Managers/admins can remove an assigned badge; removal is reflected immediately",
        "Badge cards are styled consistently with the red/white/black colour theme"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add React Query hooks for the new badge endpoints in `useQueries.ts`: `useGetBadges()` (fetches all badge definitions), `useGetStaffBadges(employeeId)` (fetches badge assignments for a specific employee), `useAssignBadgeToStaff()` (mutation), and `useRemoveBadgeFromStaff()` (mutation). Invalidate the staff badges query on successful assign or remove.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add Gamification to staff profiles which managers can assign to staff"
        ]
      },
      "acceptanceCriteria": [
        "useGetBadges hook fetches all available badges from the backend",
        "useGetStaffBadges(employeeId) fetches assignments for the specified employee",
        "useAssignBadgeToStaff mutation calls the assignBadgeToStaff backend method",
        "useRemoveBadgeFromStaff mutation calls the removeBadgeFromStaff backend method",
        "Successful assign/remove mutations invalidate the staff badges query for the affected employee"
      ]
    }
  ],
  "constraints": [
    "All Motoko logic must remain in the single main actor (backend/main.mo)",
    "Do not edit any file under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Red, white, and black must be the primary palette — do not introduce other dominant brand colours",
    "Badge assignment must be restricted to manager and admin roles only"
  ],
  "nonGoals": [
    "Adding a public-facing badge leaderboard or gamification point scoring system",
    "Automated badge awarding based on data triggers — badges are manager-assigned only",
    "Changing the Internet Identity authentication flow",
    "Adding new backend entities unrelated to badges or UI theming"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}