{
  "kind": "build_request",
  "title": "Fix popup/popout background transparency",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure all modal dialogs, dropdown menus, popovers, tooltips, and any other overlay/popup components have a fully opaque (non-transparent) background so their content is always legible against any underlying content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make any popups or popouts have a non transparent background so they are visible please"
        ]
      },
      "acceptanceCriteria": [
        "All modal dialogs (e.g. AddEmployeeModal, EditEmployeeModal, AddShiftModal, ShiftDetailModal, AddTrainingModal, EditTrainingModal, AssignBadgeModal, AddDocumentModal, EditDocumentModal, etc.) render with a fully opaque background and are readable over any page content.",
        "All dropdown menus, popovers, and select option lists render with a fully opaque background.",
        "No popup or overlay element has a semi-transparent or transparent background that allows underlying page content to bleed through and obscure the popup's own content.",
        "The fix is applied globally (e.g. via CSS variables or Tailwind utility classes in index.css or the relevant component styles) so all current and future overlays benefit.",
        "Overlays still display their backdrop/scrim (dimming the page behind them) correctly — only the popup panel itself must be opaque."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Do not alter the visual theme (red/white/black escape-room palette) — only fix background opacity on popup/overlay panels."
  ],
  "nonGoals": [
    "Redesigning or restyling any modal or popup beyond fixing background transparency.",
    "Changing the backdrop/scrim that dims the page behind modals.",
    "Adding new popup or modal components."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}