{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Escape room/venue management hub with task management, a To Do section on the hub dashboard, employee database, and a stock request system for experiences/buildings.",
  "architectural_notes": [
    "Stock request system is for escape room experiences and venue buildings (not food & drink stock management).",
    "Stock request items auto-archive 7 days after being moved to Delivered status."
  ],
  "known_issues": [],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-create-a-stock-requests-page-frontend-src-pages-stockrequestspage-tsx-with-a-submission-form-that-collects-item-name-text-input-experience-or-building-dropdown-selector-quantity-number-input-and-a-comment-textarea-the-dropdown-must-include-exactly-these-options-milton-general-the-happy-institute-the-dollhouse-wizard-of-oz-st-george-s-general-break-the-bank-marvellous-magic-school-riddled-hell-house-the-don-s-revenge-whodunit-battle-masters-fec-general-time-raiders-laser-quest-retro-arcade-7-sins-csi-disco-csi-mafia-karaoke-lounge-karaoke-disco-like-tv-game-show-splatter-room",
      "title": "Create a Stock Requests page (frontend/src/pages/StockRequestsPage.tsx) with a submission form that collects: item name (text input), experience or building (dropdown selector), quantity (number input), and a comment (textarea). The dropdown must include exactly these options: Milton General, The Happy Institute, The Dollhouse, Wizard Of Oz, St George's General, Break The Bank, Marvellous Magic School, Riddled, Hell House, The Don's Revenge, Whodunit, Battle Masters, FEC General, Time Raiders, Laser Quest, Retro Arcade, 7 Sins, CSI Disco, CSI Mafia, Karaoke Lounge, Karaoke Disco, Like TV Game Show, Splatter Room.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-add-react-query-hooks-in-frontend-src-hooks-usequeries-ts-for-stock-requests-usegetstockrequestsbystatus-usecreatestockrequest-useupdatestockrequeststatus-usearchivedeliveredrequests-and-usegetarchivedstockrequests",
      "title": "Add React Query hooks in frontend/src/hooks/useQueries.ts for stock requests: useGetStockRequestsByStatus, useCreateStockRequest, useUpdateStockRequestStatus, useArchiveDeliveredRequests, and useGetArchivedStockRequests.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-the-kanban-dashboard-on-the-stock-requests-page-with-three-columns-requested-ordered-and-delivered-each-stock-request-card-must-display-the-item-name-experience-building-quantity-and-comment-cards-must-support-both-drag-and-drop-and-a-manual-status-change-button-menu-to-move-them-between-columns-on-page-load-trigger-the-archivedeliveredrequests-backend-function-to-automatically-move-any-delivered-items-older-than-7-days-to-the-archive",
      "title": "Implement the kanban dashboard on the Stock Requests page with three columns: Requested, Ordered, and Delivered. Each stock request card must display the item name, experience/building, quantity, and comment. Cards must support both drag-and-drop and a manual status-change button/menu to move them between columns. On page load, trigger the archiveDeliveredRequests backend function to automatically move any delivered items older than 7 days to the archive.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-create-a-stock-request-archive-page-frontend-src-pages-stockrequestarchivepage-tsx-that-displays-all-archived-stock-requests-in-a-table-or-card-list-showing-item-name-experience-building-quantity-comment-date-submitted-and-date-delivered-add-a-clearly-visible-link-from-the-stock-requests-page-to-this-archive-page",
      "title": "Create a Stock Request Archive page (frontend/src/pages/StockRequestArchivePage.tsx) that displays all archived stock requests in a table or card list, showing item name, experience/building, quantity, comment, date submitted, and date delivered. Add a clearly visible link from the Stock Requests page to this archive page.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-add-stock-requests-and-stock-request-archive-as-navigable-routes-in-the-app-router-frontend-src-app-tsx-and-include-a-stock-requests-entry-in-the-sidebar-navigation-frontend-src-components-layout-sidebar-tsx-under-an-appropriate-group",
      "title": "Add Stock Requests and Stock Request Archive as navigable routes in the app router (frontend/src/App.tsx) and include a Stock Requests entry in the sidebar navigation (frontend/src/components/layout/Sidebar.tsx) under an appropriate group.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix To Do items not appearing in the hub (only showing on To Do page)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Stock request system: submit requests with item name, experience/building, quantity, comment. Dashboard with Requested/Ordered/Delivered sections, drag/mark to move between sections. Items in Delivered auto-archive after 7 days with an archive page for historical deliveries. Locations: Milton General, The Happy Institute, The Dollhouse, Wizard Of Oz, St George's General, Break The Bank, Marvellous Magic School, Riddled, Hell House, The Don's Revenge, Whodunit, Battle Masters, FEC General, Time Raiders, Laser Quest, Retro Arcade, 7 Sins, CSI Disco, CSI Mafia, Karaoke Lounge, Karaoke Disco, Like TV Game Show, Splatter Room.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add 34 employees to the database: Robert Doughty, Cameron Ingram, Reece Kelly, Chelsea Osmond, Robert Jones, Rhys Oliver, Ivana Stoneham, Luke Collins, Helen Hutchins, Alex Faulkner, Claire Read, Drew Ribbens, Erin Tree, Ellanor Hodge, Ellenor Vicary, Isabelle Mcleod, Kudakwashe Ngowera, Lucy Selway, Luke Burns, MHD Alaa Alackam, Matthew Burke, Matthew Corley, Mitchell Kelshaw, Nicole Mason, Peter Hutchins, Philip Jacobs, Rowan Sutherland, Sam Jackaman, Sophie Moore, Stephanie Tuitt, Tabitha Richards, Toby Harrison, Tommie Russell, William Gardner.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Add backend Motoko data structures and methods for stock requests. Each stock request record must store: a unique ID, item name, experience/building, quantity, comment, status (one of: #requested, #ordered, #delivered, #archived), creation timestamp, delivered timestamp (optional), and submitter name. Expose update functions to create a request, move a request to a new status, and query requests by status. Implement a function to move all delivered requests older than 7 days to archived status, callable on page load or via a scheduled check.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Escape Room Hub",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}